In [37]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [38]:
data= pd.read_csv('F:\Dataset\winequality-red.csv')

In [14]:
data.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

##### Modifying Default parameters  while loading table

In [15]:
users=["id","age","gender", "occupation", "zip code"]
data=pd.read_csv("http://bit.ly/movieusers", sep="|", header=None, names=users)

In [16]:
data.head()

   id  age gender  occupation zip code
0   1   24      M  technician    85711
1   2   53      F       other    94043
2   3   23      M      writer    32067
3   4   24      M  technician    43537
4   5   33      F       other    15213

### How do I select a pandas Series from a DataFrame?

In [17]:
data.id

0        1
1        2
2        3
3        4
4        5
5        6
6        7
7        8
8        9
9       10
10      11
11      12
12      13
13      14
14      15
15      16
16      17
17      18
18      19
19      20
20      21
21      22
22      23
23      24
24      25
25      26
26      27
27      28
28      29
29      30
      ...
913    914
914    915
915    916
916    917
917    918
918    919
919    920
920    921
921    922
922    923
923    924
924    925
925    926
926    927
927    928
928    929
929    930
930    931
931    932
932    933
933    934
934    935
935    936
936    937
937    938
938    939
939    940
940    941
941    942
942    943
Name: id, Length: 943, dtype: int64

In [18]:
data['id']

0        1
1        2
2        3
3        4
4        5
5        6
6        7
7        8
8        9
9       10
10      11
11      12
12      13
13      14
14      15
15      16
16      17
17      18
18      19
19      20
20      21
21      22
22      23
23      24
24      25
25      26
26      27
27      28
28      29
29      30
      ...
913    914
914    915
915    916
916    917
917    918
918    919
919    920
920    921
921    922
922    923
923    924
924    925
925    926
926    927
927    928
928    929
929    930
930    931
931    932
932    933
933    934
934    935
935    936
936    937
937    938
938    939
939    940
940    941
941    942
942    943
Name: id, Length: 943, dtype: int64

In [19]:
data.columns

Index(['id', 'age', 'gender', 'occupation', 'zip code'], dtype='object')

In [20]:
data["occupation and gender"]=data.occupation +','+ data.gender

In [21]:
data.occupation=data["occupation and gender"]

In [22]:
data.head(2)

   id  age gender    occupation zip code occupation and gender
0   1   24      M  technician,M    85711          technician,M
1   2   53      F       other,F    94043               other,F

### Why do some pandas commands end with parentheses (and others don't)?

## Methods end with parentheses, while attributes don't

In [23]:
data.describe(include="object")
data.describe()

               id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

#### Describe ony summarize integer datatypes' columns

##  replace all spaces with underscores in the column names by using the 'str.replace' method

In [24]:
data.columns

Index(['id', 'age', 'gender', 'occupation', 'zip code',
       'occupation and gender'],
      dtype='object')

In [25]:
data["occupation and gender"]=data["occupation and gender"].str.replace(",", "_")

In [26]:
data.head(2)

   id  age gender    occupation zip code occupation and gender
0   1   24      M  technician,M    85711          technician_M
1   2   53      F       other,F    94043               other_F

##### How do I remove columns from a pandas DataFrame?

In [27]:
data.drop(labels="zip code", axis=1)

      id  age gender       occupation occupation and gender
0      1   24      M     technician,M          technician_M
1      2   53      F          other,F               other_F
2      3   23      M         writer,M              writer_M
3      4   24      M     technician,M          technician_M
4      5   33      F          other,F               other_F
5      6   42      M      executive,M           executive_M
6      7   57      M  administrator,M       administrator_M
7      8   36      M  administrator,M       administrator_M
8      9   29      M        student,M             student_M
9     10   53      M         lawyer,M              lawyer_M
10    11   39      F          other,F               other_F
11    12   28      F          other,F               other_F
12    13   47      M       educator,M            educator_M
13    14   45      M      scientist,M           scientist_M
14    15   49      F       educator,F            educator_F
15    16   21      M  entertainment,M       entertainment_M
16    17   30      M     programmer,M          programmer_M
17    18   35      F          other,F               other_F
18    19   40      M      librarian,M           librarian_M
19    20   42      F      homemaker,F           homemaker_F
20    21   26      M         writer,M              writer_M
21    22   25      M         writer,M              writer_M
22    23   30      F         artist,F              artist_F
23    24   21      F         artist,F              artist_F
24    25   39      M       engineer,M            engineer_M
25    26   49      M       engineer,M            engineer_M
26    27   40      F      librarian,F           librarian_F
27    28   32      M         writer,M              writer_M
28    29   41      M     programmer,M          programmer_M
29    30    7      M        student,M             student_M
..   ...  ...    ...              ...                   ...
913  914   44      F          other,F               other_F
914  915   50      M  entertainment,M       entertainment_M
915  916   27      M       engineer,M            engineer_M
916  917   22      F        student,F             student_F
917  918   40      M      scientist,M           scientist_M
918  919   25      M          other,M               other_M
919  920   30      F         artist,F              artist_F
920  921   20      F        student,F             student_F
921  922   29      F  administrator,F       administrator_F
922  923   21      M        student,M             student_M
923  924   29      M          other,M               other_M
924  925   18      F       salesman,F            salesman_F
925  926   49      M  entertainment,M       entertainment_M
926  927   23      M     programmer,M          programmer_M
927  928   21      M        student,M             student_M
928  929   44      M      scientist,M           scientist_M
929  930   28      F      scientist,F           scientist_F
930  931   60      M       educator,M            educator_M
931  932   58      M       educator,M            educator_M
932  933   28      M        student,M             student_M
933  934   61      M       engineer,M            engineer_M
934  935   42      M         doctor,M              doctor_M
935  936   24      M          other,M               other_M
936  937   48      M       educator,M            educator_M
937  938   38      F     technician,F          technician_F
938  939   26      F        student,F             student_F
939  940   32      M  administrator,M       administrator_M
940  941   20      M        student,M             student_M
941  942   48      F      librarian,F           librarian_F
942  943   22      M        student,M             student_M

[943 rows x 5 columns]

##### Remove rows

In [28]:
data.drop(index=4, axis=0).head(5)

   id  age gender    occupation zip code occupation and gender
0   1   24      M  technician,M    85711          technician_M
1   2   53      F       other,F    94043               other_F
2   3   23      M      writer,M    32067              writer_M
3   4   24      M  technician,M    43537          technician_M
5   6   42      M   executive,M    98101           executive_M

####  How do I sort a pandas DataFrame or a Series?

## None of the sorting methods below affect the underlying data. (In other words, the sorting is temporary).

In [29]:
data.sort_index(axis=1).head()

   age gender  id    occupation occupation and gender zip code
0   24      M   1  technician,M          technician_M    85711
1   53      F   2       other,F               other_F    94043
2   23      M   3      writer,M              writer_M    32067
3   24      M   4  technician,M          technician_M    43537
4   33      F   5       other,F               other_F    15213

In [30]:

data.head(2)

   id  age gender    occupation zip code occupation and gender
0   1   24      M  technician,M    85711          technician_M
1   2   53      F       other,F    94043               other_F

In [31]:
data.sort_values(['gender', "id"]).head(2)

   id  age gender occupation zip code occupation and gender
1   2   53      F    other,F    94043               other_F
4   5   33      F    other,F    15213               other_F

In [32]:
data.sort_values(["id", 'gender']).head(2)

   id  age gender    occupation zip code occupation and gender
0   1   24      M  technician,M    85711          technician_M
1   2   53      F       other,F    94043               other_F

#### How do I filter rows of a pandas DataFrame by column value

In [33]:
movies = pd.read_csv('http://bit.ly/imdbratings')

HTTPError: HTTP Error 403: Forbidden

In [ ]:
movies.head(2)

## Map vs ApplyMap vs Apply


map applies a function on any column or index

apply applies a function like 'sum' in any column or row

applymap applies functon on all the elements of the dataframe

#####simplest explanation the difference between apply and applymap:

apply takes the whole column as a parameter and then assign the result to this column

applymap takes the separate cell value as a parameter and assign the result back to this cell.

In [ ]:
b=[]
def dura(i):
    if i >=200:
        return i

In [ ]:
movies["duration"].apply(lambda x : dura(x)).count()

#### Filtering rows

In [ ]:
movies[movies["duration"]>=200]

In [ ]:
movies["duration"].apply(lambda x : dura(x)).dtype
pd.to_numeric(movies["duration"],downcast='float').astype(int)
movies[['duration']].apply(sum)
# movies['duration'].apply(sum)------------------TRY IT, becoz it is not dataframe
movies["duration"]-----#------ Series
movies.duration#-------------Series
movies[["duration"]]#--------Dataframe

In [ ]:
print(type(movies["duration"]))
print(type(movies.duration))
print(type(movies[["duration"]]))

print(movies["duration"].shape==movies.duration.shape)
print(movies[["duration"]].shape==movies.duration.shape)
print(movies[["duration"]].shape==movies["duration"].shape)

In [ ]:
movies.duration.map(lambda x: dura(x))

In [ ]:
movies[movies["duration"] >=200]

In [ ]:

# movies.loc[movies.duration>=200, movies.genre]--------Try it
movies.loc[movies.duration>=200,'genre']

### How do I apply multiple filter criteria to a pandas DataFrame?

In [ ]:
movies.head(10)
movies[(movies.duration>=200) |( movies['star_rating']>= 8.2) & (movies.genre=="Crime")]
# print(True or True and False)--- Always"And" has higher preference over "OR"
movies[(movies.duration>=200) |( movies['star_rating']>= 8.2) & (movies.genre.isin(["Crime", 'Adventure', "Biography"]))]

### When reading from a file, how do I read in only a subset of the columns?

In [ ]:
ufo = pd.read_csv('http://bit.ly/uforeports', usecols=["City"])

In [ ]:
ufo.head()

### When reading from a file, how do I read in only a subset of the rows?

In [ ]:
ufo = pd.read_csv('http://bit.ly/uforeports', usecols=["City"], nrows=20)

In [ ]:
ufo

## How do I iterate through a Series And DataFrame

In [ ]:
for i in ufo.City:
    print(i)

In [ ]:
ufo = pd.read_csv('http://bit.ly/uforeports')

#### An iterable is anything you’re able to loop over.

An iterator is the object that does the actual iterating.

You can get an iterator from any iterable by calling the built-in iter function on the iterable.

In [ ]:
for i , j in ufo.iterrows():
    print(i, j.City, j.State)

### How do I drop all non-numeric columns from a DataFrame?

In [ ]:
ufo.select_dtypes(include=[np.number])

### . How do I use string methods in pandas

# string methods for pandas Series are accessed via 'str'

In [ ]:
ufo.City.str.upper().head()

In [ ]:
ufo.City.loc[21:22]

In [ ]:
ufo.City.str.contains('Itacha')

In [ ]:
ufo.City.str.replace('',"{").str.replace('',"}")

###  How do I change the data type of a pandas Series?

In [ ]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks.head()

In [ ]:
drinks.beer_servings.astype(float)

## alternatively, change the data type of a Series while reading in a file

In [ ]:
drinks=pd.read_csv("http://bit.ly/drinksbycountry", dtype={"beer_servings": float}) # use dictonary

In [ ]:
drinks.beer_servings.dtype

# To select multiple rows, put all the row labels you want to select in a list and pass that to .loc. 
>>> df.loc[row_selection, column_selection]

# .loc includes the last value with slice notation

https://medium.com/dunder-data/selecting-subsets-of-data-in-pandas-6fcd0170be9c

#### groupby

In [ ]:

drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks.head()

In [ ]:
drinks[drinks.continent=="Africa"]['beer_servings'].mean()
# calculate the mean beer servings just for countries in Africa

In [ ]:

# calculate the mean beer servings for each continent
drinks.groupby('continent')["beer_servings"].mean()

## aggregation functions can be applied simultaneously

In [ ]:
# multiple aggregation functions can be applied simultaneously
drinks.groupby('continent')["beer_servings"].agg(['count', "mean","min","max"])

In [ ]:
%matplotlib inline

In [ ]:
drinks.groupby("continent").mean().plot(kind="bar")

### Explore Pandas Series

In [ ]:
movies = pd.read_csv('http://bit.ly/imdbratings')
movies.head()

In [ ]:
movies.genre.count()

In [ ]:
movies.genre.value_counts()

## Display percentage of raw counts

In [ ]:
movies.genre.value_counts(normalize=True)

In [ ]:

movies.genre.nunique()

## compute a cross-tabulation of two Series

In [ ]:
pd.crosstab(movies.genre,movies.content_rating)

### handle missing values

In [ ]:
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.tail()

#### read_csv detects missing values (by default) when reading the file, and replaces them with this special value.

##### isnull vs not null

In [ ]:
ufo.isnull().head()

In [ ]:
ufo.notnull().head()

In [34]:
ufo.isnull().sum()

NameError: name 'ufo' is not defined

### Why the count of null is calculated ??
pandas converts True to 1 and False to 0.

In [7]:
ufo[ufo.isnull()].head()

NameError: name 'ufo' is not defined

#### How to handle missing values depends on the dataset as well as the nature of your analysis.

##### if 'any' values are missing in a row, then drop that row

In [ ]:
ufo.dropna()